hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/i2s_demo/i2s_demo.c
//******************************************************************************
//
// The canvas widget acting as the background to the play/stop button.
//
//******************************************************************************
Canvas(g_sPlayBackground, WIDGET_ROOT, 0, 0,
       &g_sKitronix320x240x16_SSD2119, 190, 210, 90, 30,
       CANVAS_STYLE_FILL, ClrBlack, 0, 0, 0, 0, 0, 0);

//******************************************************************************
//
// The canvas widgets for the wav file information.
//
//******************************************************************************
extern tCanvasWidget g_sWaveInfoBackground;

char g_pcTime[40]="";
Canvas(g_sWaveInfoTime, &g_sWaveInfoBackground, 0, 0,
       &g_sKitronix320x240x16_SSD2119, 140, 70, 140, 10,
       CANVAS_STYLE_FILL | CANVAS_STYLE_TEXT | CANVAS_STYLE_TEXT_LEFT |
       CANVAS_STYLE_TEXT_OPAQUE, ClrBlack, ClrWhite, ClrWhite, g_pFontFixed6x8,
       g_pcTime, 0, 0);

char g_pcFormat[40]="";
Canvas(g_sWaveInfoSample, &g_sWaveInfoBackground, &g_sWaveInfoTime, 0,
       &g_sKitronix320x240x16_SSD2119, 140, 55, 140, 10,
       CANVAS_STYLE_FILL | CANVAS_STYLE_TEXT | CANVAS_STYLE_TEXT_LEFT |
       CANVAS_STYLE_TEXT_OPAQUE, ClrBlack, ClrWhite, ClrWhite, g_pFontCmss12,
       g_pcFormat, 0, 0);

char g_pcFileName[16]="";
Canvas(g_sWaveInfoFileName, &g_sWaveInfoBackground, &g_sWaveInfoSample, 0,
       &g_sKitronix320x240x16_SSD2119, 140, 40, 140, 10,
       CANVAS_STYLE_FILL | CANVAS_STYLE_TEXT | CANVAS_STYLE_TEXT_LEFT |
       CANVAS_STYLE_TEXT_OPAQUE, ClrBlack, ClrWhite, ClrWhite, g_pFontCmss12,
       g_pcFileName, 0, 0);

//******************************************************************************
//
// The canvas widget acting as the background for the wav file information.
//
//******************************************************************************
Canvas(g_sWaveInfoBackground, WIDGET_ROOT, &g_sPlayBackground,
       &g_sWaveInfoFileName, &g_sKitronix320x240x16_SSD2119, 130, 30, 155, 80,
       CANVAS_STYLE_OUTLINE | CANVAS_STYLE_FILL, ClrBlack, ClrWhite, ClrWhite,
       g_pFontCmss12, 0, 0, 0);

//******************************************************************************
//
// The slider widget used for volume control.
//
//******************************************************************************
#define INITIAL_VOLUME_PERCENT 60
Slider(g_sSlider, &g_sListBackground, &g_sWaveInfoBackground, 0,
       &g_sKitronix320x240x16_SSD2119, 290, 30, 30, 180, 0, 100,
       INITIAL_VOLUME_PERCENT, (SL_STYLE_FILL | SL_STYLE_BACKG_FILL |
       SL_STYLE_OUTLINE | SL_STYLE_VERTICAL), ClrGreen, ClrBlack, ClrWhite,
       ClrWhite, ClrWhite, 0, 0, 0, 0, OnSliderChange);

//******************************************************************************
//
// The canvas widget acting as the background to the left portion of the
// display.
//
//******************************************************************************
Canvas(g_sListBackground, WIDGET_ROOT, &g_sSlider, &g_sDirList,
       &g_sKitronix320x240x16_SSD2119, 10, 60, 120, 200,
       CANVAS_STYLE_FILL, ClrBlack, 0, 0, 0, 0, 0, 0);

//******************************************************************************
//
// The heading containing the application title.
//
//******************************************************************************
Canvas(g_sHeading, WIDGET_ROOT, &g_sListBackground, 0,
       &g_sKitronix320x240x16_SSD2119, 0, 0, 320, 23,
       (CANVAS_STYLE_FILL | CANVAS_STYLE_OUTLINE | CANVAS_STYLE_TEXT),
       ClrDarkBlue, ClrWhite, ClrWhite, g_pFontCm20, "i2s demo", 0, 0);

//******************************************************************************
//
// State information for keep track of time.
//
//******************************************************************************
static unsigned long g_ulBytesPlayed;
static unsigned long g_ulNextUpdate;

//******************************************************************************
//
// Buffer management and flags.
//
//******************************************************************************
#define AUDIO_BUFFER_SIZE       4096
static unsigned char g_pucBuffer[AUDIO_BUFFER_SIZE];
unsigned long g_ulMaxBufferSize;

//
// Flags used in the g_ulFlags global variable.
//
#define BUFFER_BOTTOM_EMPTY     0x00000001
#define BUFFER_TOP_EMPTY        0x00000002
#define BUFFER_PLAYING          0x00000004
static volatile unsigned long g_ulFlags;

//
// Globals used to track playback position.
//
static unsigned long g_ulBytesRemaining;
static unsigned short g_usMinutes;
static unsigned short g_usSeconds;

//******************************************************************************
//
// Handler for bufffers being released.
//
//******************************************************************************
void
BufferCallback(void *pvBuffer, unsigned long ulEvent)
{
    if(ulEvent & BUFFER_EVENT_FREE)
    {
        if(pvBuffer == g_pucBuffer)
        {
            //
            // Flag if the first half is free.
            //
            g_ulFlags |= BUFFER_BOTTOM_EMPTY;
        }
        else
        {
            //
            // Flag if the second half is free.
            //
            g_ulFlags |= BUFFER_TOP_EMPTY;
        }

        //
        // Update the byte count.
        //
        g_ulBytesPlayed += AUDIO_BUFFER_SIZE >> 1;
    }
}

//******************************************************************************
//
// Basic wav file RIFF header information used to open and read a wav file.
//
//******************************************************************************
#define RIFF_CHUNK_ID_RIFF      0x46464952
#define RIFF_CHUNK_ID_FMT       0x20746d66
#define RIFF_CHUNK_ID_DATA      0x61746164

#define RIFF_TAG_WAVE           0x45564157

#define RIFF_FORMAT_UNKNOWN     0x0000
#define RIFF_FORMAT_PCM         0x0001
#define RIFF_FORMAT_MSADPCM     0x0002
#define RIFF_FORMAT_IMAADPCM    0x0011

