hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/i2s_demo/i2s_demo.c
//******************************************************************************
//
// This function is used to tell when to update the playback times for a file.
// It will only update the screen at 1 second intervals but can be called more
// often with no result.
//
//******************************************************************************
void
DisplayTime(unsigned long ulForceUpdate)
{
    unsigned long ulSeconds;
    unsigned long ulMinutes;

    //
    // Only display on the screen once per second.
    //
    if((g_ulBytesPlayed >= g_ulNextUpdate) || (ulForceUpdate != 0))
    {
        //
        // Set the next update time to one second later.
        //
        g_ulNextUpdate = g_ulBytesPlayed + g_sWaveHeader.ulAvgByteRate;

        //
        // Calculate the integer number of minutes and seconds.
        //
        ulSeconds = g_ulBytesPlayed/g_sWaveHeader.ulAvgByteRate;
        ulMinutes = ulSeconds/60;
        ulSeconds -= ulMinutes*60;

        //
        // Print the time string in the format mm.ss/mm.ss
        //
        usprintf(g_pcTime, "%2d:%02d/%d:%02d", ulMinutes,ulSeconds,
                 g_usMinutes, g_usSeconds);

        //
        // Display the updated time on the screen.
        //
        WidgetPaint((tWidget *)&g_sWaveInfoTime);
    }
}

//******************************************************************************
//
// This function is used to update the file information area of the screen.
//
//******************************************************************************
void
UpdateFileInfo(void)
{
    short sSelected;

    //
    // Get the current selection from the list box.
    //
    sSelected = ListBoxSelectionGet(&g_sDirList);

    //
    // Just return if nothing is currently selected.
    //
    if(sSelected == -1)
    {
        //
        // Set the time and format strings to null strings.
        //
        g_pcTime[0] = 0;
        g_pcFormat[0] = 0;
    }
    //
    // If this is successful then the file passed in was a wav file.
    //
    else if(WaveOpen(&g_sFileObject, g_pcFilenames[sSelected],
                     &g_sWaveHeader) == FR_OK)
    {

        //
        // Update the file name information.
        //
        strncpy(g_pcFileName, g_pcFilenames[sSelected], 16);

        //
        // Print the formatted string so that it can be displayed.
        //
        usprintf(g_pcFormat, "%d Hz %d bit ", g_sWaveHeader.ulSampleRate,
                 g_sWaveHeader.usBitsPerSample);

        //
        // Concatenate the number of channels.
        //
        if(g_sWaveHeader.usNumChannels == 1)
        {
            strcat(g_pcFormat, "Mono");
        }
        else
        {
            strcat(g_pcFormat, "Stereo");
        }

        //
        // Close the file, it will be reopend on play.
        //
        f_close(&g_sFileObject);

        //
        // Update the real display time.
        //
        DisplayTime(0);
    }
    else
    {
        //
        // Update the file name information.
        //
        strncpy(g_pcFileName, g_pcFilenames[sSelected], 16);

        //
        // Set the time and format strings to null strings.
        //
        g_pcTime[0] = 0;
        g_pcFormat[0] = 0;
    }

    //
    // Update all to the files information on the screen.
    //
    WidgetPaint((tWidget *)&g_sWaveInfoFileName);
    WidgetPaint((tWidget *)&g_sWaveInfoTime);
    WidgetPaint((tWidget *)&g_sWaveInfoSample);
    WidgetPaint((tWidget *)&g_sSlider);
}

//******************************************************************************
//
// This function will handle stopping the playback of audio.  It will not do
// this immediately but will defer stopping audio at a later time.  This allows
// this function to be called from an interrupt handler.
//
//******************************************************************************
void
WaveStop(void)
{
    //
    // Stop playing audio.
    //
    g_ulFlags &= ~BUFFER_PLAYING;
}

//******************************************************************************
//
// This function will handle reading the correct amount from the wav file and
// will also handle converting 8 bit unsigned to 8 bit signed if necessary.
//
//******************************************************************************
unsigned short
WaveRead(FIL *psFileObject, tWaveHeader *pWaveHeader, unsigned char *pucBuffer)
{
    unsigned long ulBytesToRead;
    unsigned short usCount;

    //
    // Either read a half buffer or just the bytes remaining if we are at the
    // end of the file.
    //
    if(g_ulBytesRemaining < g_ulMaxBufferSize)
    {
        ulBytesToRead = g_ulBytesRemaining;
    }
    else
    {
        ulBytesToRead = g_ulMaxBufferSize;
    }

    //
    // Read in another buffer from the sd card.
    //
    if(f_read(&g_sFileObject, pucBuffer, ulBytesToRead, &usCount) != FR_OK)
    {
        return(0);
    }

    //
    // Decrement the number of data bytes remaining to be read.
    //
    g_ulBytesRemaining -= usCount;

    //
    // Need to convert the audio from unsigned to signed if 8 bit
    // audio is used.
    //
    if(pWaveHeader->usBitsPerSample == 8)
    {
        Convert8Bit(pucBuffer, usCount);
    }

    return(usCount);
}

//******************************************************************************
//
// This will play the file passed in via the psFileObject parameter based on
// the format passed in the pWaveHeader structure.  The WaveOpen() function
// can be used to properly fill the pWaveHeader and psFileObject structures.
//
//******************************************************************************
unsigned long
WavePlay(FIL *psFileObject, tWaveHeader *pWaveHeader)
{
    static unsigned short usCount;

    //
    // Mark both buffers as empty.
    //
    g_ulFlags = BUFFER_BOTTOM_EMPTY | BUFFER_TOP_EMPTY;

    //
    // Indicate that the application is about to start playing.
    //
    g_ulFlags |= BUFFER_PLAYING;

    while(1)
    {
        //
        // Must disable I2S interrupts during this time to prevent state
        // problems.
        //
        IntDisable(INT_I2S0);

        //
        // If the refill flag gets cleared then fill the requested side of the
        // buffer.
        //
        if(g_ulFlags & BUFFER_BOTTOM_EMPTY)
        {
            //
            // Read out the next buffer worth of data.
            //
            usCount = WaveRead(psFileObject, pWaveHeader, g_pucBuffer);

            //
            // Start the playback for a new buffer.
            //
            SoundBufferPlay(g_pucBuffer, usCount, BufferCallback);

            //
            // Bottom half of the buffer is now not empty.
            //
            g_ulFlags &= ~BUFFER_BOTTOM_EMPTY;
        }

        if(g_ulFlags & BUFFER_TOP_EMPTY)
        {
            //
            // Read out the next buffer worth of data.
            //
            usCount = WaveRead(psFileObject, pWaveHeader,
                               &g_pucBuffer[AUDIO_BUFFER_SIZE >> 1]);

            //
            // Start the playback for a new buffer.
            //
            SoundBufferPlay(&g_pucBuffer[AUDIO_BUFFER_SIZE >> 1],
                            usCount, BufferCallback);

            //
            // Top half of the buffer is now not empty.
            //
            g_ulFlags &= ~BUFFER_TOP_EMPTY;

            //
            // Update the current time display.
            //
            DisplayTime(0);
        }

        //
        // If something reset this while playing then stop playing and break
        // out of the loop.
        //
        if((g_ulFlags & BUFFER_PLAYING) == 0)
        {
            //
            // Change the text to indicate that the button is now for play.
            //
            strcpy(g_psPlayText, "Play");
            WidgetPaint((tWidget *)&g_sPlayBtn);

            //
            // Update the new file information if necessary.
            //
            UpdateFileInfo();

            break;
        }

        //
        // Audio playback is done once the count is below a full buffer.
        //
        if((usCount < g_ulMaxBufferSize) || (g_ulBytesRemaining == 0))
        {
            //
            // Change the text to indicate that the button is now for play.
            //
            strcpy(g_psPlayText, "Play");
            WidgetPaint((tWidget *)&g_sPlayBtn);

            //
            // No longer playing audio.
            //
            g_ulFlags &= ~BUFFER_PLAYING;

            //
            // Wait for the buffer to empty.
            //
            while(g_ulFlags != (BUFFER_TOP_EMPTY | BUFFER_BOTTOM_EMPTY))
            {
            }

            //
            // Update the real display time.
            //
            DisplayTime(1);

            break;
        }

        //
        // Must disable I2S interrupts during this time to prevent state
        // problems.
        //
        IntEnable(INT_I2S0);

        //
        // Process any messages in the widget message queue.
        //
        WidgetMessageQueueProcess();
    }

    //
    // Close out the file.
    //
    WaveClose(psFileObject);

    return(0);
}

