hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/i2s_demo/i2s_demo.c
//******************************************************************************
//
// The listbox widget callback function.
//
// This function is called whenever someone changes the selected entry in the
// listbox containing the files.
//
//******************************************************************************
void
OnListBoxChange(tWidget *pWidget, short usSelected)
{
    //
    // Update only if playing a file.
    //
    if((g_ulFlags & BUFFER_PLAYING) == 0)
    {
        //
        // Update the file info area.
        //
        UpdateFileInfo();
    }
    else
    {
        //
        // Should never be playing if the selection changes.
        //
        WaveStop();
    }
}

//******************************************************************************
//
// The "Play/Stop" button widget callback function.
//
// This function is called whenever someone presses the "Play/Stop" button.
//
//******************************************************************************
void
OnBtnPlay(tWidget *pWidget)
{
    short sSelected;

    //
    // If already playing then this was a press to stop playback.
    //
    if(g_ulFlags & BUFFER_PLAYING)
    {
        WaveStop();
    }
    else
    {
        //
        // Get the current selection from the list box.
        //
        sSelected = ListBoxSelectionGet(&g_sDirList);

        //
        // Is there any selection?
        //
        if(sSelected == -1)
        {
            return;
        }
        else
        {
            if(WaveOpen(&g_sFileObject, g_pcFilenames[sSelected],
                        &g_sWaveHeader) == FR_OK)
            {
                //
                // Change the text on the button to Stop.
                //
                strcpy(g_psPlayText, "Stop");
                WidgetPaint((tWidget *)&g_sPlayBtn);

                //
                // Indicate that wave playback should start.
                //
                g_ulFlags |= BUFFER_PLAYING;
            }
        }
    }
}

//******************************************************************************
//
// Handle changes in the volume slider.
//
//******************************************************************************
void
OnSliderChange(tWidget *pWidget, long lValue)
{
    SoundVolumeSet(lValue);
}

//******************************************************************************
//
// This is the handler for this SysTick interrupt.  FatFs requires a
// timer tick every 10 ms for internal timing purposes.
//
//******************************************************************************
void
SysTickHandler(void)
{
    //
    // Call the FatFs tick timer.
    //
    disk_timerproc();
}

//******************************************************************************
//
// This function is called to read the contents of the current directory on
// the SD card and fill the listbox containing the names of all files.
//
//******************************************************************************
static int
PopulateFileListBox(tBoolean bRepaint)
{
    unsigned long ulItemCount;
    FRESULT fresult;

    //
    // Empty the list box on the display.
    //
    ListBoxClear(&g_sDirList);

    //
    // Make sure the list box will be redrawn next time the message queue
    // is processed.
    //
    if(bRepaint)
    {
        WidgetPaint((tWidget *)&g_sDirList);
    }

    //
    // Open the current directory for access.
    //
    fresult = f_opendir(&g_sDirObject, "/");

    //
    // Check for error and return if there is a problem.
    //
    if(fresult != FR_OK)
    {
        //
        // Ensure that the error is reported.
        //
        return(fresult);
    }

    ulItemCount = 0;

    //
    // Enter loop to enumerate through all directory entries.
    //
    while(1)
    {
        //
        // Read an entry from the directory.
        //
        fresult = f_readdir(&g_sDirObject, &g_sFileInfo);

        //
        // Check for error and return if there is a problem.
        //
        if(fresult != FR_OK)
        {
            return(fresult);
        }

        //
        // If the file name is blank, then this is the end of the
        // listing.
        //
        if(!g_sFileInfo.fname[0])
        {
            break;
        }

        //
        // Add the information as a line in the listbox widget.
        //
        if(ulItemCount < NUM_LIST_STRINGS)
        {
            //
            // Ignore directories.
            //
            if((g_sFileInfo.fattrib & AM_DIR) == 0)
            {
                strncpy(g_pcFilenames[ulItemCount], g_sFileInfo.fname,
                         MAX_FILENAME_STRING_LEN);
                ListBoxTextAdd(&g_sDirList, g_pcFilenames[ulItemCount]);
            }
        }

        //
        // Ignore directories.
        //
        if((g_sFileInfo.fattrib & AM_DIR) == 0)
        {
            //
            // Move to the next entry in the item array we use to populate the
            // list box.
            //
            ulItemCount++;
        }
    }

    //
    // Made it to here, return with no errors.
    //
    return(0);
}

//******************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//******************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, unsigned long ulLine)
{
}
#endif

//******************************************************************************
//
// The program main function.  It performs initialization, then handles wav
// file playback.
//
//******************************************************************************
int
main(void)
{
    FRESULT fresult;

    //
    // Set the system clock to run at 50MHz from the PLL.
    //
    ROM_SysCtlClockSet(SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN |
                       SYSCTL_XTAL_16MHZ);

    //
    // Set the device pinout appropriately for this board.
    //
    PinoutSet();

    //
    // Configure and enable uDMA
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);
    SysCtlDelay(10);
    ROM_uDMAControlBaseSet(&sDMAControlTable[0]);
    ROM_uDMAEnable();

    //
    // Configure SysTick for a 100Hz interrupt.
    //
    ROM_SysTickPeriodSet(SysCtlClockGet() / TICKS_PER_SECOND);
    ROM_SysTickEnable();
    ROM_SysTickIntEnable();

    //
    // Enable Interrupts
    //
    ROM_IntMasterEnable();

    //
    // Initialize the display driver.
    //
    Kitronix320x240x16_SSD2119Init();

    //
    // Initialize the touch screen driver.
    //
    TouchScreenInit();

    //
    // Set the touch screen event handler.
    //
    TouchScreenCallbackSet(WidgetPointerMessage);

    //
    // Add the compile-time defined widgets to the widget tree.
    //
    WidgetAdd(WIDGET_ROOT, (tWidget *)&g_sHeading);

    //
    // Set some initial strings.
    //
    ListBoxTextAdd(&g_sDirList, "Initializing...");

