hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/i2s_demo/i2s_demo.c
    WidgetAdd(WIDGET_ROOT, (tWidget *)&g_sPlayBtn);

    //
    // Issue the initial paint request to the widgets then immediately call
    // the widget manager to process the paint message.  This ensures that the
    // display is drawn as quickly as possible and saves the delay we would
    // otherwise experience if we processed the paint message after mounting
    // and reading the SD card.
    //
    WidgetPaint(WIDGET_ROOT);
    WidgetMessageQueueProcess();

    //
    // Mount the file system, using logical disk 0.
    //
    fresult = f_mount(0, &g_sFatFs);
    if(fresult != FR_OK)
    {
        return(1);
    }

    //
    // Populate the list box with the contents of the root directory.
    //
    PopulateFileListBox(true);

    //
    // Not playing anything right now.
    //
    g_ulFlags = 0;

    //
    // Configure the I2S peripheral.
    //
    SoundInit(0);

    //
    // Set the initial volume to something sensible.  Beware - if you make the
    // mistake of using 24 ohm headphones and setting the volume to 100% you
    // may find it is rather too loud!
    //
    SoundVolumeSet(INITIAL_VOLUME_PERCENT);

    //
    // Set the volume slider position to match the volume we just set.  This
    // guards against any touchscreen activity (which could change the slider
    // position) from leaving the slider out of sync with the actual volume.
    //
    SliderValueSet(&g_sSlider, INITIAL_VOLUME_PERCENT);
    WidgetPaint((tWidget *)&g_sSlider);

    //
    // Enter an (almost) infinite loop for reading and processing commands from
    //the user.
    //
    while(1)
    {
        //
        // If wav playback has started let the WavePlay routine take over main
        // routine.
        //
        if(g_ulFlags & BUFFER_PLAYING)
        {
            //
            // Try to play Wav file.
            //
            WavePlay(&g_sFileObject, &g_sWaveHeader);
        }

        //
        // Process any messages in the widget message queue.
        //
        WidgetMessageQueueProcess();
    }
}
